Amiya200/stm32_water_tank/Core/Src/screen.c
    typedef struct {
        bool raw;
        bool stable;
        uint32_t lastChange;
        uint32_t pressTime;
        uint32_t lastRepeat;
        bool longSent;
    } BtnState;

    static BtnState btn[BTN_COUNT] = {0};

    uint32_t now = HAL_GetTick();
    UiButton event = BTN_NONE;

    for (int i = 0; i < BTN_COUNT; i++)
    {
        bool raw = Switch_IsPressed(i);

        // 🔹 Detect change
        if (raw != btn[i].raw)
        {
            btn[i].raw = raw;
            btn[i].lastChange = now;
        }

        // 🔹 Debounce
        if ((now - btn[i].lastChange) > 40) // smoother (40ms)
        {
            if (btn[i].stable != raw)
            {
                btn[i].stable = raw;

                if (raw) // 🔘 Pressed
                {
                    btn[i].pressTime = now;
                    btn[i].longSent = false;
                    btn[i].lastRepeat = now;
                }
                else // 🔘 Released
                {
                    if (!btn[i].longSent)
                    {
                        switch (i)
                        {
                            case 0: return BTN_RESET;
                            case 1: return BTN_SELECT;
                            case 2: return BTN_UP;
                            case 3: return BTN_DOWN;
                        }
                    }
                }
            }
        }

        // 🔹 Long Press
        if (btn[i].stable && !btn[i].longSent)
        {
            if ((now - btn[i].pressTime) > 800) // faster long press
            {
                btn[i].longSent = true;

                switch (i)
                {
                    case 0: return BTN_RESET_LONG;
                    case 1: return BTN_SELECT_LONG;
                    case 2: return BTN_UP_LONG;
                    case 3: return BTN_DOWN_LONG;
                }
            }
        }

        // 🔹 Hold Repeat (Smooth scrolling)
        if (btn[i].stable && btn[i].longSent)
        {
            if ((now - btn[i].lastRepeat) > 120) // smoother repeat
            {
                btn[i].lastRepeat = now;

                switch (i)
                {
                    case 2: return BTN_UP;
                    case 3: return BTN_DOWN;
                }
            }
        }
    }

    return event;
}
void Screen_HandleSwitches(void)
{
    UiButton b = decode_button_press();
    uint32_t now_sw = HAL_GetTick();
    {
        static uint32_t rep_start[2] = {0, 0};
        static uint32_t rep_last[2]  = {0, 0};

        bool in_menu = (ui != UI_DASH &&
                        ui != UI_WELCOME &&
                        ui != UI_COUNTDOWN &&
                        ui != UI_NONE);
        if (in_menu)
        {
            for (int ri = 0; ri < 2; ri++)
            {
                bool held = Switch_IsPressed(ri == 0 ? 2 : 3);
                if (held)
                {
                    if (rep_start[ri] == 0) rep_start[ri] = now_sw;

                    uint32_t held_ms = now_sw - rep_start[ri];
                    if (held_ms >= REPEAT_START_MS &&
                        (now_sw - rep_last[ri]) >= REPEAT_INTERVAL_MS)
                    {
                        rep_last[ri] = now_sw;
                        if (b == BTN_NONE)
                            b = (ri == 0) ? BTN_UP : BTN_DOWN;
                    }
                }
                else
                {
                    rep_start[ri] = 0;
                    rep_last[ri]  = 0;
                }
            }
        }
        else
        {
            rep_start[0] = rep_start[1] = 0;
            rep_last[0]  = rep_last[1]  = 0;
        }
    }
    if (b == BTN_NONE) return;
    refreshInactivityTimer();

    if (ui == UI_COUNTDOWN && b == BTN_DOWN)
    {
        ModelHandle_StopCountdown();
        ui = UI_DASH;
        screenNeedsRefresh = true;
        return;
    }

    if (b == BTN_RESET)
    {
        if (ui == UI_DASH)
        {
            if (!ModelHandle_IsRestartActive())
                ModelHandle_StartRestart();
            else
                ModelHandle_StopRestart();
        }
        else
        {
            switch (ui)
            {
                case UI_SETTINGS_GAP:
                case UI_SETTINGS_RETRY:
                case UI_SETTINGS_UV:
                case UI_SETTINGS_OV:
                case UI_SETTINGS_OL:
                case UI_SETTINGS_UL:
                case UI_SETTINGS_MAXRUN:
                case UI_SETTINGS_PWRREST:
                case UI_SETTINGS_FACTORY:
                case UI_DEVSET_EDIT_DATE:
                case UI_DEVSET_EDIT_TIME:
                case UI_DEVSET_EDIT_DAY:
                    ui = UI_DEVSET_MENU;
                    break;
                case UI_DEVSET_MENU:
                case UI_ADD_DEVICE_MENU:
                case UI_ADD_DEVICE_PAIR:
                case UI_ADD_DEVICE_REMOVE:
                case UI_ADD_DEVICE_PAIR_DONE:
                case UI_ADD_DEVICE_REMOVE_DONE:
                    ui = UI_MENU;
                    break;
                case UI_COUNTDOWN_EDIT_MIN:
                    ui = UI_COUNTDOWN;
                    break;
                case UI_COUNTDOWN:
                    ModelHandle_StopCountdown();
                    ui = UI_DASH;
                    break;
                default:
                    ui = UI_DASH;
                    break;
            }
        }
        screenNeedsRefresh = true;
        return;
    }

    if (ui == UI_RESET_CONFIRM)
    {
        if (b == BTN_UP || b == BTN_DOWN)
            reset_confirm_yes = !reset_confirm_yes;
        else if (b == BTN_SELECT)
        {
            if (reset_confirm_yes)
            {
                ModelHandle_FactoryReset();
                edit_settings_dry_en  = ModelHandle_GetDryRunEnable() ? 1 : 0;
                edit_settings_gap_s   = ModelHandle_GetGapTime() / 60;
                edit_settings_retry   = ModelHandle_GetDryRunRetryGap() / 60;
                edit_settings_uv      = ModelHandle_GetUnderVolt();
                edit_settings_ov      = ModelHandle_GetOverVolt();
                edit_settings_maxrun  = ModelHandle_GetMaxRunTime();
                edit_settings_ol      = (int)ModelHandle_GetOverloadLimit();
                edit_settings_ul      = (int)ModelHandle_GetUnderloadLimit();
                edit_settings_pwrrest = ModelHandle_GetPowerRestoreMode();
                clear_sticky_mode_flags();
            }
            ui = UI_DASH;
        }
        screenNeedsRefresh = true;
        return;
    }

    if (ui == UI_DASH)
    {
        switch (b)
        {
            case BTN_RESET_LONG:
                ModelHandle_ToggleManual();
                break;
            case BTN_SELECT:
                if (!autoActive)
                    ModelHandle_StartAuto(edit_auto_gap_s, edit_auto_maxrun_min, edit_auto_retry);
                else
                    ModelHandle_StopAuto();
                break;
            case BTN_SELECT_LONG:
                ui = UI_MENU;
                menu_idx = 0;
                menu_view_top = 0;
                screenNeedsRefresh = true;
                return;
            case BTN_UP:
                if (autoActive)
                {
                    if (!timerActive)
                        ModelHandle_Button3_SinglePress();
                    else
                        ModelHandle_StopTimer();
                }
                screenNeedsRefresh = true;
                break;
            case BTN_UP_LONG:
                /* ── Semi-auto toggle ──────────────────────────────────────
                 * sticky_set_semi() called here so it is symmetric with the
                 * countdown path and works even if show_dash() scheduling
                 * were ever changed.
                 * ──────────────────────────────────────────────────────── */
                if (!semiAutoActive)
                {
                    ModelHandle_StartSemiAuto();
                    sticky_set_semi();          /* set sticky at start */
                }
                else
                {
                    ModelHandle_StopSemiAuto();
                }
                screenNeedsRefresh = true;
                break;
            case BTN_DOWN:
                /* ── Countdown toggle ──────────────────────────────────────
                 * sticky_set_countdown() is called HERE, BEFORE ui changes
                 * to UI_COUNTDOWN.  This is the critical fix:
                 *
                 * Once ui == UI_COUNTDOWN, show_dash() is never called while
                 * countdownActive is true (button path), so we cannot rely on
                 * show_dash() to set dash_countdown_shown in time.
                 * Setting it here guarantees the flag is correct when the
                 * user later stops the countdown and returns to the dash.
                 * ──────────────────────────────────────────────────────── */
                if (!countdownActive)
                {
                    ModelHandle_StartCountdown(edit_countdown_min * 60);
                    countdownActive = true;
                    sticky_set_countdown();     /* ← MUST be before ui changes */
                    ui = UI_COUNTDOWN;
                }
                else
                {
                    ModelHandle_StopCountdown();
                    countdownActive = false;
                    ui = UI_DASH;
                }
                screenNeedsRefresh = true;
                return;
            case BTN_DOWN_LONG:
                if (!countdownActive)
                {
                    ui = UI_COUNTDOWN_EDIT_MIN;
                    edit_countdown_min = 1;
                    screenNeedsRefresh = true;
                }
                break;
            default:
                break;
        }
        return;
    }

    if (ui == UI_MENU)
    {
        if (b == BTN_SELECT || b == BTN_SELECT_LONG) menu_select();
        else if (b == BTN_DOWN && menu_idx < MAIN_MENU_COUNT - 1) menu_idx++;
        else if (b == BTN_UP   && menu_idx > 0) menu_idx--;
        screenNeedsRefresh = true;
        return;
    }

