Amiya200/stm32_water_tank/Core/Src/screen.c
    if (ui == UI_DEVSET_MENU)
    {
        if (b == BTN_SELECT || b == BTN_SELECT_LONG) menu_select();
        else if (b == BTN_DOWN && devset_idx < DEVSET_MENU_COUNT - 1) devset_idx++;
        else if (b == BTN_UP   && devset_idx > 0) devset_idx--;
        screenNeedsRefresh = true;
        return;
    }

    if (ui != UI_DASH)
    {
        if      (b == BTN_UP)        increase_edit_value(1);
        else if (b == BTN_DOWN)      decrease_edit_value(1);
        else if (b == BTN_UP_LONG)   increase_edit_value(5);
        else if (b == BTN_DOWN_LONG) decrease_edit_value(5);
        else if (b == BTN_SELECT)    menu_select();
        screenNeedsRefresh = true;
        return;
    }
}

void Screen_Update(void)
{
    uint32_t now = HAL_GetTick();

    if (ui >= UI_MAX_)
    {
        ui = UI_DASH;
        screenNeedsRefresh = true;
    }

    /* Welcome → Dash transition */
    if (ui == UI_WELCOME && (now - lastLcdUpdateTime >= WELCOME_MS))
    {
        lastLcdUpdateTime = now;
        ui = UI_DASH;
        screenNeedsRefresh = true;
    }

    /* Auto-back to dash on inactivity (not from welcome/dash/countdown) */
    if (ui != UI_WELCOME &&
        ui != UI_DASH &&
        ui != UI_COUNTDOWN &&
        (now - lastUserAction >= AUTO_BACK_MS))
    {
        ui = UI_DASH;
        screenNeedsRefresh = true;
    }

    /* Countdown: refresh every second so timer counts down visibly */
    if ((ui == UI_COUNTDOWN) &&
        (now - lastLcdUpdateTime) >= 1000)
    {
        lastLcdUpdateTime = now;
        screenNeedsRefresh = true;
    }

    if (ui == UI_DASH && dash_cycle_start == 0)
        dash_cycle_start = now;

    if (ui == UI_DASH && dash_page == 0 &&
        (now - dry_blink_start) >= DRY_BLINK_MS)
    {
        dry_blink_slot  = dry_blink_slot ? 0 : 1;
        dry_blink_start = now;
        show_dash();
    }

    if (ui == UI_DASH && dash_page == 1 &&
        (now - dry_blink_start) >= DRY_BLINK_MS)
    {
        dry_blink_start = now;
        show_dash();
    }

    if (screenNeedsRefresh || ui != last_ui)
    {
        lcd_clear();
        last_ui = ui;
        screenNeedsRefresh = false;

        if (ui == UI_DASH)
        {
            if (dash_cycle_start == 0) dash_cycle_start = now;
            dry_blink_slot  = 0;
            dry_blink_start = now;
        }

        switch (ui)
        {
            case UI_WELCOME:              show_welcome(); break;
            case UI_DASH:                 show_dash(); break;
            case UI_MENU:                 show_menu(); break;

            case UI_DEVSET_MENU:          show_devset_menu(); break;

            case UI_ADD_DEVICE_MENU:      show_add_device_menu(); break;
            case UI_ADD_DEVICE_PAIR:      show_add_device_pair(); break;
            case UI_ADD_DEVICE_REMOVE:    show_add_device_remove(); break;
            case UI_ADD_DEVICE_PAIR_DONE: show_add_device_pair_done(); break;
            case UI_ADD_DEVICE_REMOVE_DONE: show_add_device_remove_done(); break;

            case UI_DEVSET_EDIT_DATE:     show_devset_edit_date(); break;
            case UI_DEVSET_EDIT_TIME:     show_devset_edit_time(); break;
            case UI_DEVSET_EDIT_DAY:      show_devset_edit_day(); break;

            case UI_RESET_CONFIRM:        show_reset_confirm(); break;

            case UI_COUNTDOWN:            show_countdown(); break;
            case UI_COUNTDOWN_EDIT_MIN:   show_countdown_edit_min(); break;

            case UI_TIMER_SLOT_SELECT:    show_timer_slot_select(); break;
            case UI_TIMER_EDIT_DAYS:      show_timer_days(); break;
            case UI_TIMER_EDIT_GAP:       show_timer_gap(); break;
            case UI_TIMER_EDIT_ENABLE:    show_timer_enable(); break;
            case UI_TIMER_EDIT_SUMMARY:   show_timer_summary(); break;

            case UI_AUTO_MENU:            show_auto_menu(); break;
            case UI_AUTO_EDIT_GAP:        show_auto_gap(); break;
            case UI_AUTO_EDIT_MAXRUN:     show_auto_maxrun(); break;
            case UI_AUTO_EDIT_RETRY:      show_auto_retry(); break;

            case UI_SEMI_AUTO:            show_semi_auto(); break;

            case UI_TWIST:                show_twist(); break;

            default:
                lcd_line0("Unknown UI");
                lcd_line1("Check state");
                break;
        }
    }
}
